"""
Варіант 8

Задача №1: Напишіть програму для перетворення введених секунд у кількість днів, годин, хвилин та секунд.
Автор: Гладкович Ярослав
"""

# Пропонує користувачеві ввести число
час = float(input("Уведіть число: "))

# Обчислює кількість повних днів у заданому проміжку часу
дні = час // (24 * 3600)
# Оновлює змінну часу, щоб вона зберігала решту секунд після віднімання повних днів.
час = час % (24 * 3600)

# Обчислює кількість повних годин у часі, що залишився.
години = час // 3600
# Оновлює змінну часу так, щоб після віднімання повних годин зберігалися секунди, що залишилися.
час %= 3600

# Обчислює кількість повних хвилин у часі, що залишився.
хвилини = час // 60
# Оновлює змінну часу так, щоб після віднімання повних хвилин зберігалися секунди, що залишилися.
час %= 60

# Змінна 'час' тепер представляє кількість секунд, що залишилися, тобто кількість секунд.
секунди = час

# Виводить тривалість часу у форматі "Дні:Години:Хвилини:секунди"
print("Дні:Години:Хвилини:Секунди-> %d:%d:%d:%d" % (дні, години, хвилини, секунди))