"""
Варіант 8

Задача №2:Дано два моменти часу в межах однієї доби. Для кожного моменту вказано години, хвилини і секунди. Відомо, що другий момент часу настав не раніше першого. Визначте скільки секунд пройшло між двома моментами часу. Програма на вхід отримує шість цілих чисел в окремих рядках. Перші три цілих числа відповідають годинам, хвилинам і секундам першого моменту, наступні три числа відповідають другому моменту. Години задаються числом від 0 до 23 включно. Хвилини і секунди - від 0 до 59.
Автор: Гладкович Ярослав
"""
# Пропонує ввести числа для першого періоду часу
години1 = int(input())
хвилини1 = int(input())
секунди1 = int(input())

# Пропонує ввести числа для другого періоду часу
години2 = int(input())
хвилини2 = int(input())
секунди2 = int(input())

# Підраховує результат
всього_секунд1 = години1 * 3600 + хвилини1 * 60 + секунди1
всього_секунд2 = години2 * 3600 + хвилини2 * 60 + секунди2
секунд_пройшло = всього_секунд2 - всього_секунд1
print(секунд_пройшло)
